core/src/test/resources/integration_test_files/soap/xml_files/soap_request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ConversionRate xmlns="http://www.webserviceX.NET/">
            <FromCurrency>AFA</FromCurrency>
            <ToCurrency>GBP</ToCurrency>
        </ConversionRate>
    </soap:Body>
</soap:Envelope>